<?php
/**
  * 至简PHP开源框架
  * 版本：至简纯净版1.0
  * 官方网站：https://github.com/dengdaiderizi521/zhijian-pure
  * 日期：2015-05-07
  */
/**
  * 定义网站字符集
  */
	header('content-type:text/html;charset=utf-8');


/**
  *---------------------------------------------------------------
  * 定义网站时区
  *---------------------------------------------------------------
  */
	date_default_timezone_set('PRC');


/*
 *---------------------------------------------------------------
 * 定义核心文件目录路径
 *---------------------------------------------------------------
 *
 * 框架核心文件目录路径，您可以自定义核心文件文件夹名称，但是需要
 * 和这里定义的名称一致。如果核心文件夹与框架不在同一文件夹下，需要
 * 定义项目文件夹的全路径
 *
 */
	$system_path = 'system';

/*
 *---------------------------------------------------------------
 * 定义项目文件存放目录名称
 *---------------------------------------------------------------
 *
 * 项目文件目录路径，您可以自定义项目文件文件夹名称，但是需要
 * 和这里定义的名称一致。如果项目与框架不在同一文件夹下，需要
 * 定义项目文件夹的全路径
 *
 */
	$application_folder = 'app';


/*
 * ---------------------------------------------------------------
 *  设置系统路径
 * ---------------------------------------------------------------
 */
	if (realpath($system_path) !== FALSE){
		$system_path = realpath($system_path).'/';
	}
	
	// 确认核心文件夹是否存在
	if ( ! is_dir($system_path)){
		exit("没有找到框架核心目录");
	}

/*
 * -------------------------------------------------------------------
 *  设置路径常量
 * -------------------------------------------------------------------
 */
	define('BASEPATH', str_replace("\\", "/",dirname(__FILE__).'/'));
	define('SYSTEMPATH', str_replace("\\", "/", $system_path));
	// The path to the "application" folder
	if (is_dir($application_folder)){
		define('APPPATH', $application_folder.'/');
	}else{
		if ( ! is_dir(BASEPATH.$application_folder.'/')){
			exit("没有找到项目目录");
		}
		define('APPPATH', BASEPATH.$application_folder.'/');
	}

/*
 * --------------------------------------------------------------------
 * 载入核心文件
 * --------------------------------------------------------------------
 */
require_once SYSTEMPATH.'core/ZhiJian.php';